artwitter_api/app/controllers/arts_controller.rb

  def index
    @arts = Art.all
---
SELECT "arts".* FROM "arts"

  def create
    puts art_params
    @art = Art.new(art_params)

    if @art.save
---
INSERT INTO "arts" ("title", "artist_name", "image_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Testing"], ["artist_name", "tetsing"], ["image_url", "tesyting"], ["created_at", "2021-05-13 14:16:15.078107"], ["updated_at", "2021-05-13 14:16:15.078107"]]

  def show
    @art = Art.find(params[:id])
---
SELECT "arts".* FROM "arts" WHERE "arts"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]